interface MajorInformation {
  name: string;
  engName: string;
  address: string;
  tel: string;
  mail: string;
  professor: string;
  greeting: string;
  bossImage: string;
  title: string;
  contents: string;
  iamge: string;
}

export const yiuAiInfo: MajorInformation = {
  name: `AI융합학부`,
  engName: `School of AI Convergence`,
  greeting: `컴퓨터과학의 핵심기술에 대한 선도적인 연구력을 바탕으로 ACM(Association for Computing Machinery)의 컴퓨터과학 분야 커리큘럼에 따라 학부생들을 위한 세계 최고 수준의 교육을 제공합니다. 이를 위해 전임교수의 전달식 강의에 그치지 않고 산업체 및 연구소의 임직원을 산학협력중점교수 및 특강 강사로 초대하여, 학생과 산업체가 서로 유기적으로 학부교육에 직간접을 참여가능하도록 노력하고 있습니다.
이론 중심의 전공 기본 교육은 물론, 산업체의 기술 수요와 미래 세대에게 요구되는 최신 문제 해결을 위한 실제적인 기술이 반영된 교육, 현장실습이 강조된 교육, 그리고 최신 신기술 교육을 위한 교과과정위원회를 상시 유지하고 있습니다.
또한, 글로벌 전문인력 양성을 위해 다수의 외국인 전임교수를 초빙하였고, 전공선택 과목 등에서 영어사용 강좌 개설 및 오픈소스 기반의 소프트웨어 및 프로그래밍 교육을 강화하고 있습니다.
2022년부터는 인공지능융합대학으로 독립하여 인공지능학과와 함께 성장하고 있으며, 융합인재 양성을 위해 기존 복수전공 확대와 부전공 지원 뿐만아니라 연세대학교내 다양한 전공(경영, 경제, 사회과학, 의학, 법학, 공학 등)과 함께 융합심화전공 및 마이크로전공 개설을 통해 연세대학교 학생들을 위한 소프트웨어 및 인공지능 융합교육을 개발하고 있습니다.
컴퓨터과학 대학원은 최신 컴퓨팅 연구 분야에 기초하여 혁신적인 교과과정을 개발하여 컴퓨터 소프트웨어 및 하드웨어 분야의 기본연구 분야와 이를 바탕으로 응용한 다양한 심화 및 응용 연구분야에서 미래사회의 컴퓨팅 및 융복합 분야를 선도할 연구를 수행하고 있습니다.
특히, 대학원생을 위하여 교내외 장학금 및 BK21Plus 장학금과 연구지원금 등이 제공되며, 세부전공 선택의 자율성이 제공되어 신속한 산업과 사회의 기술 수요에 적극적으로 부응할 수 있는 체제를 갖추고 있습니다.
또한, 컴퓨터과학과에는 BK21Plus 4단계, 인공지능대학원 등을 통하여 첨단 컴퓨팅 분야에서 세계 최고 수준의 IT 전문 인력 양성 및 국제적으로 경쟁력 있는 연구를 수행하여 프리미엄급 국제학술대회에 다수의 논문들을 발표하고 있습니다.
`,
  address: `[17092] 경기도 용인시 처인구 용인대학로 134 용인대학교 AI융합학부`,
  tel: `031-8020-2761`,
  mail: `aihakbu@yongin.ac.kr`,
  professor: "이경재",
  bossImage: "https://cdn.aitimes.kr/news/photo/202305/27921_42075_3441.jpg",
  title: `새로운 진화의 시작,
  글로벌 AI 시대를 선도하는 창의·융합형 고급 인재 양성`,
  contents: `컴퓨터과학의 핵심기술에 대한 선도적인 연구력을 바탕으로 ACM(Association for Computing Machinery)의 컴퓨터과학 분야 커리큘럼에 따라 학부생들을 위한 세계 최고 수준의 교육을 제공합니다. 이를 위해 전임교수의 전달식 강의에 그치지 않고 산업체 및 연구소의 임직원을 산학협력중점교수 및 특강 강사로 초대하여, 학생과 산업체가 서로 유기적으로 학부교육에 직간접을 참여가능하도록 노력하고 있습니다.
이론 중심의 전공 기본 교육은 물론, 산업체의 기술 수요와 미래 세대에게 요구되는 최신 문제 해결을 위한 실제적인 기술이 반영된 교육, 현장실습이 강조된 교육, 그리고 최신 신기술 교육을 위한 교과과정위원회를 상시 유지하고 있습니다.
또한, 글로벌 전문인력 양성을 위해 다수의 외국인 전임교수를 초빙하였고, 전공선택 과목 등에서 영어사용 강좌 개설 및 오픈소스 기반의 소프트웨어 및 프로그래밍 교육을 강화하고 있습니다.
2022년부터는 인공지능융합대학으로 독립하여 인공지능학과와 함께 성장하고 있으며, 융합인재 양성을 위해 기존 복수전공 확대와 부전공 지원 뿐만아니라 연세대학교내 다양한 전공(경영, 경제, 사회과학, 의학, 법학, 공학 등)과 함께 융합심화전공 및 마이크로전공 개설을 통해 연세대학교 학생들을 위한 소프트웨어 및 인공지능 융합교육을 개발하고 있습니다.
컴퓨터과학 대학원은 최신 컴퓨팅 연구 분야에 기초하여 혁신적인 교과과정을 개발하여 컴퓨터 소프트웨어 및 하드웨어 분야의 기본연구 분야와 이를 바탕으로 응용한 다양한 심화 및 응용 연구분야에서 미래사회의 컴퓨팅 및 융복합 분야를 선도할 연구를 수행하고 있습니다.
특히, 대학원생을 위하여 교내외 장학금 및 BK21Plus 장학금과 연구지원금 등이 제공되며, 세부전공 선택의 자율성이 제공되어 신속한 산업과 사회의 기술 수요에 적극적으로 부응할 수 있는 체제를 갖추고 있습니다.
또한, 컴퓨터과학과에는 BK21Plus 4단계, 인공지능대학원 등을 통하여 첨단 컴퓨팅 분야에서 세계 최고 수준의 IT 전문 인력 양성 및 국제적으로 경쟁력 있는 연구를 수행하여 프리미엄급 국제학술대회에 다수의 논문들을 발표하고 있습니다.`,
  iamge:
    "https://www.yongin.ac.kr/cmn/cmm/fms/getImage.do?atchFileId=FILE_000000000009220&fileSn=0",
};

export const ai_info = {
  slogan: `새로운 진화의 시작,
  글로벌 AI 시대를 선도하는 창의·융합형 고급 인재 양성`,
  shorts: `미래를 주도할 4차 산업 중심의 AI·빅데이터 글로벌 핵심 인재 양성을 목표로, 체계적인 이론 교육과 산업 현장의 실무 프로젝트 중심 교과과정을 가지고 있습니다. 인공지능, 머신러닝, 딥러닝, 빅데이터, 컴퓨터 비전, 자연 언어 처리 등 첨단 기술 및 웹 및 모바일 프로그래밍 소프트웨어 기본 교과과정을 통해, 창의적 사고력과 자기 주도적 문제 해결 능력을 갖춘 전문가를 양성하고자 합니다.`,
  goal: `창의·융합 AI+X 전문가 양성`,
  objective: `- 이론과 실무 능력을 갖춘 AI·빅데이터 기술 인재 양성
- Cloud, Web 및 App 등 설계 및 구현 능력을 갖춘 소프트웨어 전문가 양성
- 올바른 품성과 도덕성을 갖춘 윤리적인 인재 양성
- 인류와 국가에 기여할 수 있는 AI융합 전문가 양성`,
  afterGraduation: `AI·빅데이터 소프트웨어 개발자·연구원, AI·빅데이터 데이터 과학자, AI·빅데이터 서비스 기획자·컨설턴트, 스타트업 창업, CRM, 데이터마이닝, 고객정보분석, 사회여론조사, 인터넷 리서치 관련 업체, 공무원, 대학원 진학 등 국내·외 다양한 산업체, 연구소, 정부 기관의 관련 분야로 진출`,
  certificate: `빅데이터분석기사, 정보처리기사, 정보처리산업기사등 국가 자격증 및 민간, 국제 자격증을 취득할 수 있는 교육과정을 운영
  `,
  iamge:
    "https://www.yongin.ac.kr/cmn/cmm/fms/getImage.do?atchFileId=FILE_000000000009220&fileSn=0",
};
