import { Council, CouncilEvent } from "../../../models/council";

export const temp_council: Council = {
  name: "rAIn",
  link: "https://www.instagram.com/yiu._.ai?igsh=M2JpNTllbXZwdjZ2",
  year: 0,
  slogan: `필요할 때 내리는 단비처럼\n학우분들을 위해 노력하는 학생회 rAIn이 되겠습니다.`,
  thumbnail: "",
  people: "",
  description: `자연과학대학 학생회는 자연과학대학 학부생을 대표하는 단체로, 자연과학대학 학부생들이 학생사회의 구성원으로서 가지는 이해와 요구를 최대한 반영하여 실현하는 것을 목적으로 합니다. 이러한 목적을 달성하기 위해 학생회는 필요에 따라 구성원의 의견을 수렴하기도 하고, 때로는 학생사회의 새로운 의제를 제시하기도 하며, 구성원 간 화합을 위해 다양한 행사를 준비하기도 합니다.
자연과학대학 학생회의 핵심 조직에는 운영위원회와 집행위원회가 있습니다. 운영위원회는 자연과학대학 학생회장단, 각 학부 · 과의 학생회장, 자연대 동아리 연합회 의장으로 구성되며 정기적인 운영위원회를 통하여 자연과학대학 내외의 여러 사안에 대해 논의하는 상임 의결기구입니다. 반면 집행위원회는 집행위원장과 집행위원들로 구성되며 자연대 학생 대표자 회의와 운영위원회의 의결에 근거하여 사업을 집행하는 상설 집행기구입니다.`,
};

export const tempCouncilEvents: CouncilEvent[] = [
  {
    id: 1,
    title: "새내기새로배움터",
    description:
      "신입생들이 입학하기 전, 대학 생활 적응에 도움이 되는 여러 정보를 전달하고 구성원 간의 친목을 도모하기 위한 행사입니다. 행사는 신입생 오리엔테이션, 학부/과별로 진행되는 각종 게임과 학생회에서 준비한 폐막제 등으로 구성됩니다.",
  },
  {
    id: 2,
    title: "친목조",
    description:
      "자연과학대학 내 여러 학부/과 학우 사이의 경계를 뛰어넘어 친목을 도모하여 단과대 차원의 결속력을 강화하기 위한 프로그램입니다. 서로 다른 여러 학부의 구성원으로 이루어진 친목조는 함께 주어진 미션들을 수행하며 친분을 쌓게 됩니다.",
  },
  {
    id: 3,
    title: "시험 기간 간식 행사",
    description:
      "시험에 지친 자연과학대학 학우들을 응원하는 행사입니다. 다양한 간식들을 마련하여 학생들에게 배부하며, 자연과학대학 구성원으로서의 결속력을 강화하는 계기가 됩니다.",
  },
  {
    id: 4,
    title: "전공학교",
    description:
      "학기 중 어려운 전공 공부를 따라갈 수 있도록 미리 그 과목을 수강한 선배가 멘토가 되어 방학 중 수요가 높은 전공과목의 학습을 도와주는 프로그램입니다.",
  },
  {
    id: 5,
    title: "과학봉사단",
    description:
      "자연과학대학과 학생회가 함께하여 8월 초, 4박 5일간 여러 지역에 내려가 지역 학생들과 함께 미리 준비한 다양한 과학 관련 프로그램을 진행합니다. 각 학부/과별로 그 특성에 맞는 다양한 프로그램을 진행하고 고등학생들의 멘토가 되어주면서 사회에 이바지하는 봉사 정신을 배우게 됩니다.",
  },
  {
    id: 6,
    title: "가을 축제",
    description:
      "자연과학대학 축제는 학생회의 주도 아래 모두가 함께 만들어가는 축제로, 자연과학대학 구성원의 화합을 도모하고 대학 생활에 활력을 불어넣는 기회를 제공합니다.",
  },
];
